app/controllers/greetings_controller.rb

    def random
      render json: Greeting.all.sample
---
SELECT "greetings".* FROM "greetings"